test/data/xml/pelco/PullMessages.Request.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope 
  xmlns:s="http://www.w3.org/2003/05/soap-envelope" 
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
  xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
  xmlns:wsa="http://www.w3.org/2005/08/addressing" 
  xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" 
  xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" 
  xmlns:tt="http://www.onvif.org/ver10/schema" 
  xmlns:ter="http://www.onvif.org/ver10/error" 
  xmlns:tev="http://www.onvif.org/ver10/events/wsdl">
  <s:Header>
    <Action s:mustUnderstand="1">http://www.onvif.org/ver10/events/wsdl/PullPointSubscription/PullMessagesRequest</Action>
    <wsa:ReplyTo>
      <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
    </wsa:ReplyTo>
    <wsse:Security s:mustUnderstand="1">
      <wsu:Timestamp wsu:Id="Time">
        <wsu:Created>2018-02-22T21:38:29.227Z</wsu:Created>
        <wsu:Expires>2018-02-22T21:38:39.227Z</wsu:Expires>
      </wsu:Timestamp>
      <wsse:UsernameToken wsu:Id="User">
        <wsse:Username>admin</wsse:Username>
        <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">C0voRqFf4WiZDgJ8+2rIcCOmQe8=</wsse:Password>
        <wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">tlzRgD9x/NoS294CWn8EeQ==</wsse:Nonce>
        <wsu:Created 
          xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">2018-02-22T21:38:29.227Z
        </wsu:Created>
      </wsse:UsernameToken>
    </wsse:Security>
    <wsa:To s:mustUnderstand="1">http://10.10.1.66/onvif/eventing_service?id=urn:uuid:88232ace-694e-fb22-3953-e76fe45c4cd6</wsa:To>
    <SubscriptionId s:mustUnderstand="1" s:IsReferenceParameter="1"
      xmlns="urn:schemas-pelco-com:ws:addressing:1">urn:uuid:88232ace-694e-fb22-3953-e76fe45c4cd6
    </SubscriptionId>
  </s:Header>
  <s:Body>
    <tev:PullMessages>
      <tt:Timeout>2018-02-22T21:38:39.224Z</tt:Timeout>
      <tt:MessageLimit>99</tt:MessageLimit>
    </tev:PullMessages>
  </s:Body>
</s:Envelope>